# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'dockutil'

# Prompt
brew 'starship'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'neovim'

# Apps
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'orbstack'
cask 'rectangle'
cask 'jetbrains-toolbox'
cask 'hammerspoon'
cask 'imageoptim'
cask 'transmission'
cask 'alt-tab'
cask 'maccy'
cask 'telegram-desktop'
cask 'keka'
cask 'kekaexternalhelper'
cask 'visual-studio-code'

# Quicklook
# cask 'qlmarkdown'
# cask 'quicklook-json'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-symbols-only-nerd-font'

# Mac App Store
mas 'Amphetamine', id: 937984704
